# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы.

x1 = int(100)
x2 = float(101.0)
x3 = bool(True)
x4 = str('100')
x5 = None
print(type(x1), type(x2), type(x3), type(x4), type(x5), sep= '\n')